app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "bobby@bobby.com"]]
---
    def create
      # find if any user has that email
      user = User.find_by(email: params[:email])