app/controllers/users_controller.rb

  def create
    @user = User.new
    @user.name = params[:name]
    @user.email = params[:email]
    @user.password = params[:password]
    @user.password_confirmation = params[:password_confirmation]

  if params[:password] == params[:password_confirmation]#checks to see if the password and the password_confirmation match. If they don't an error will display to the user
    flash.now[:alert] = "Passwords must match, please fill in you passwords again."
  end


    if @user.save #saves the user if everything checks out
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"